processor/src/web/web/WEB-INF/classes/META-INF/rnip/getPayments_byDate.xml

<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><S:Header><wsse:Security S:actor="http://smev.gosuslugi.ru/actors/smev" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="SenderCertificate"/></wsse:Security></S:Header><S:Body wsu:Id="body"><!-- Здесь идёт тело запроса--><n1:UnifoTransferMsg xsi:schemaLocation="http://roskazna.ru/SmevUnifoService/ UnifoTransferMsg.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:n1="http://roskazna.ru/SmevUnifoService/" xmlns:n5="http://www.altova.com/samplexml/other-namespace" xmlns:ns1="http://www.bssys.com/xsd/Catalog" xmlns:pirq="http://roskazna.ru/xsd/PGU_ImportRequest" xmlns:smev="http://smev.gosuslugi.ru/rev111111" xmlns:smev2="http://roskazna.ru/SmevUnifoService/" xmlns:pdrq="http://roskazna.ru/xsd/PGU_DataRequest" xmlns:unifo="http://rosrazna.ru/xsd/SmevUnifoService" xmlns:org="http://roskazna.ru/xsd/Organization" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><smev:Message><smev:Sender><smev:Code>000000001</smev:Code><smev:Name>External Organization</smev:Name></smev:Sender><smev:Recipient><smev:Code> MSKS11</smev:Code><smev:Name>ИС_РНиП</smev:Name></smev:Recipient><smev:TypeCode>GFNC</smev:TypeCode><smev:Status>REQUEST</smev:Status><smev:Date>2012-09-24T12:35:39.121+04:00</smev:Date><smev:ExchangeType>6</smev:ExchangeType></smev:Message><smev:MessageData><smev:AppData><unifo:exportData><pdrq:DataRequest kind="PAYMENT"><PostBlock><ID>254510</ID><TimeStamp>2011-03-11T09:15:25.0Z</TimeStamp><SenderIdentifier>%CONTRAGENT_ID%</SenderIdentifier></PostBlock><StartDate>%START_DATE%</StartDate><EndDate>%END_DATE%</EndDate></pdrq:DataRequest></unifo:exportData></smev:AppData></smev:MessageData></n1:UnifoTransferMsg></S:Body></S:Envelope>